# 文章状态
article_status = (
        (0,'未审核'),
        (1,'已审核'),
        (2,'已发布'),
    )

# 领域字典
# area_dict = (
#     (1,'编程语言'),
#     (2,'硬件'),
#     (3,'数据结构与算法'),
#     (4,'操作系统'),
#     (5,'数据库'),
#     (6,'计算机网络'),
#     (7,'软件工程'),
#     (8,'人工智能'),
#     (9,'机器学习'),
#     (10,'数据挖掘'),
#     (11,'信息安全'),
#     (12,'云计算'),
#     (13,'物联网'),
#     (14,'大数据'),
#     (15,'人机交互'),
#     (16,'计算机视觉'),
#     (17, '机器人'),
#     (18, '生物信息技术'),
#     (19, '图像处理'),
#     (20, '计算机金融'),
# )


# 种类的字典
type_dict = (
    (1,"文章"),
    (2,"视频"),
    (3,"书籍"),
)

# 入学年份
yearStartColleage = (
    ('2014',"2014届",),
    ('2015',"2015届",),
    ('2016',"2016届",),
    ('2017',"2017届",),
    ('2018',"2018届",),
    ('2019',"2019届",),
    ('2020',"2020届",),
    ('2021',"2021届",),
    ('2022',"2022届",),
)

